export const posts = [
		{
			avatar_color: "red",
			avatar_word: "T",
			name_person: "Tema Ametov",
			time_realise: 19,
			title: "Microsoft предупредила о перебоях в работе устаревших клиентов Teams к концу марта 2024 года",
			time_read: 2,
			views: 230,
			tema: "Софт, Видеоконференцсвязь",
			photo: "https://habrastorage.org/getpro/habr/upload_files/c81/ffe/f4a/c81ffef4a9330f369fa6878099893e57.JPG",
			text_cut: "Intel в ходе мероприятия AI Everywhere представила мобильные процессоры Core Ultra, которые войдут в линейку Meteor Lake. Они будут поставляться с NPU или нейронным процессором, предлагающим «ускорение искусственного интеллекта с низким энергопотреблением и разгрузку процессора/графического процессора.",
			text_full: "Компания утверждает, что чип Core Ultra 7 165H обеспечивает 11-процентное улучшение многопоточной производительности по сравнению с конкурирующими процессорами для ноутбуков, такими как AMD Ryzen 7 7840U, Qualcomm Snapdragon 8cx Gen 3 и Apple M3. Он также предлагает снижение энергопотребления на 25% по сравнению с предшественником Intel Core i7-1370P и имеет до 79% меньшую мощность, чем AMD Ryzen 7 7840U, «при той же мощности 28 Вт для ультратонких ноутбуков.",
			links: 'TemaAmetov'
		},{
			avatar_color: "green",
			avatar_word: "D",
			name_person: "Denis Paramonov",
			time_realise: 25,
			title: "Иголка в стоге сена: ищем следы работы C2-фреймворка Sliver",
			time_read: 10,
			views: 320,
			tema: "Информационная безопасность, Тестирование IT-систем",
			photo: "https://habrastorage.org/r/w1560/getpro/habr/upload_files/074/ac8/ac1/074ac8ac17574b3939ca1ed11f46d624.png",
			text_cut: "Привет, Хабр, на связи лаборатория кибербезопасности компании AP Security! Не так давно на нашем канале вышла статья по использованию фреймворка постэксплуатации Sliver C2 от Bishop Fox.",
			text_full: "Sliver C2 представляет собой кроссплатформенный расширяемый фреймворк постэксплуатации, созданный командой Bishop Fox. Он написан преимущественно на языке Go, что делает его быстрым, переносимым и легко настраиваемым. Такая универсальность делает инструмент популярным в Red Team проектах.",
			links: 'DenisParamonov'
		},{
			avatar_color: "lime",
			avatar_word: "K",
			name_person: "Kirill Zaitcev",
			time_realise: 30,
			title: "Создание атомарных коммитов в Git",
			time_read: 7,
			views: 440,
			tema: "Git, Системы управления версиями, Управление разработкой",
			photo: "https://habrastorage.org/r/w780/getpro/habr/upload_files/252/d04/6f9/252d046f939028fcd46cd522adb482a3.jpeg",
			text_cut: "Мы все были там: Вы работали над множеством изменений одновременно, некоторые из которых не имели ничего общего. Для удобства вы решили объединить все эти изменения в один коммит и на этом закончить. Но хотя это может показаться заманчивым, на самом деле это может привести к большим проблемам в дальнейшем. Большие коммиты могут:",
			text_full: "\n" +
				"Затушевать источник ошибок или регрессий в будущем.\n" +
				"Затруднить возврат нежелательных изменений без возврата желательных.\n" +
				"Делать большие тикеты более перегруженными и сложными в управлении.\n" +
				"В последнее время я выработал привычку делать атомарные коммиты, чтобы сделать свою работу более управляемой; я рекомендую вам попробовать и посмотреть, работает ли это для вас.",
			links: 'KirillZaitcev'
		},{
			avatar_color: "pink",
			avatar_word: "S",
			name_person: "Sergey Kolupov",
			time_realise: 43,
			title: "Искусственный интеллект: между гиперболой и реальностью — навигация в эпоху шумихи и ожиданий",
			time_read: 4,
			views: 512,
			tema: "Искусственный интеллект, Нанотехнологии, Криптовалюты, Будущее здесь",
			photo: "https://habrastorage.org/r/w1560/getpro/habr/upload_files/141/6ee/4a9/1416ee4a9f7324d763704b22cf6c5cb2.png",
			text_cut: "Это был момент, сияющий искоркой. Граждане по всему миру сидели на краю своих кресел, затаив дыхание. Звучали громкие заявления. Конец капитализма, глобальной финансовой системы, близок. Прощай, неравенство в богатстве. До свидания, подавление заработной платы. Каждый сможет добывать свои деньги во сне. Криптовалюта. А затем искорка потухла. Некоторые вещи изменились. ",
			text_full: "На сегодняшний день криптовалюта оценивается примерно в 0,023% от всей денежной массы мира. Глобальная финансовая система по-прежнему функционирует. Криптовалюта в значительной степени рассматривается, в том числе благодаря таким деятелям, как Сэм Бэнкман-Фрид и другими, как пирамидальная схема XXI века. Это была машина для создания шумихи в мире технологий.",
			links: 'SergeyKolupov'
		},{
			avatar_color: "purple",
			avatar_word: "A",
			name_person: "Andrei Perov",
			time_realise: 49,
			title: "Математика и физика для простой и результативной учёбы (Серия: Cельскому учителю в помощь). Часть II: Предмет математики",
			time_read: 27,
			views: 669,
			tema: "Математика, Читальный зал, Научно-популярное, Физика",
			photo: "https://habrastorage.org/r/w780/getpro/habr/upload_files/c0b/e56/82d/c0be5682d49b94557e3de3dac16af1d5.jpg",
			text_cut: "Мы познакомимся с элементами математики, каждодневно пользуемыми каждым естествознателем (математиком, физиком, инженером). Высшее образование строят на их познании и умении применить. В доступном изложении вы узнаете о современной геометрии и универсальных инструментах математической физики и инженерии (пространстве состояний, уравнениях движения, теории поля, энергии, конечных автоматах).",
			text_full: "В манифестах кратко излагают программу, принципы деятельности, иногда призыв.\n" +
				"У каждого из нас в кармане лежит машина, чьи физико-математические модели чувственно неотличимы от реальности. Она связана с космическими спутниками и миллионами таких же машин. Способна считать и читать каждый удар сердца, эмоцию. Несомненно, эти машины требует эффективной физики и математики.",
			links: 'AndreiPerov'
		},
	]